{"id":31676,"date":"2018-04-17T12:03:59","date_gmt":"2018-04-17T16:03:59","guid":{"rendered":"https:\/\/blog-v2.sweeten.com\/?p=31676"},"modified":"2023-05-17T14:18:26","modified_gmt":"2023-05-17T18:18:26","slug":"so-you-want-to-own-a-house","status":"publish","type":"post","link":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/","title":{"rendered":"So You Want to Own a House?"},"content":{"rendered":"<h2>The expert guide for city dwellers who are seriously on the house hunt<\/h2>\n<p><img decoding=\"async\" class=\"alignnone size-chrono wp-image-32951 mb-0\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1-723x482.jpg\" alt=\"SWEETEN Tracey McFarland Kitchen12 (1)\" width=\"723\" height=\"482\" data-overlay-text=\"\" data-overlay-color=\"\" srcset=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1-723x482.jpg 723w, https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1-300x200.jpg 300w, https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1-600x400.jpg 600w, https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1-585x390.jpg 585w, https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1.jpg 1000w\" sizes=\"(max-width: 723px) 100vw, 723px\" \/><\/p>\n<p style=\"text-align: justify;\">You’ve been eyeing the possibilities of having a lawn, an extra bedroom, and maybe even a man or woman cave. When you go to look at houses, you come back to your apartment feeling just a little bit more cramped.<\/p>\n<p style=\"text-align: justify;\">It’s exciting to think of buying a house. New spaces and new neighborhoods present new possibilities. But what does it really take in terms of cost to transition from an apartment to a house and what can you do to get on the right path from the start?<\/p>\n<p><a href=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Apt-to-House.jpg\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignnone wp-image-31958 mb-0 size-chrono\" title=\"house costs\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Apt-to-House-723x189.jpg\" alt=\"buying a house\" width=\"723\" height=\"189\" data-overlay-text=\"\" data-overlay-color=\"\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">Let&#8217;s begin with the basics: Your fixed costs will be your property tax, mortgage, and insurance. Then there are the unplanned scenarios with maintenance, mechanicals, and energy as the main areas of focus.<\/p>\n<p style=\"text-align: justify;\">To improve your return, you&#8217;ll want to be on the lookout for potential runaway costs. Here&#8217;s how you can reduce your unknowns even before you close.<\/p>\n<p><strong>WHAT CAN HAPPEN:<\/strong><\/p>\n<p><strong>You own the whole enchilada<\/strong><\/p>\n<p style=\"text-align: justify;\">It can be a rude awakening when your pipe bursts, and instead of calling the super, you’re the one standing in the water waiting for the plumber to come. A house means responsibility for the whole structure, not just a piece of it. If something goes wrong, whether it’s the foundation, roof, supports, or siding, it can be costly, as well as time-consuming, to deal with it.<\/p>\n<p><strong>WHAT YOU CAN DO:<\/strong><\/p>\n<p><strong>Consider the age of the home and all the components<\/strong><\/p>\n<p style=\"text-align: justify;\">That 1890’s house with the period details and original woodwork is so seductive, but while you are swooning, note the ages of the roof, boiler, siding, etc. and also the replacement costs. Underestimating the replacement costs and schedule can leave you utterly unprepared financially.<\/p>\n<p style=\"text-align: justify;\">Consider this true story: a pair of homeowners bought a big Victorian with great bones at a steal of a price. Sounds like a great investment in theory. But when it came time to replace the slate roof two years later, they discovered that each 20-foot-square area would cost $10,000, or $120,000 for the whole surface, which turned their good investment on its head.<\/p>\n<p style=\"text-align: justify;\">To reduce your risks, make a list of all major components, their ages, <a href=\"https:\/\/www.nachi.org\/life-expectancy.htm\" target=\"_blank\" rel=\"noopener\">their expected lifespan<\/a>, and whether they are in or out of warranty. Doing this before deciding on a home to purchase will make your comparison of potential homes as investments much more informed!<\/p>\n<p><a href=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/03\/1000-Project-Graph-6-3.jpg\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignnone wp-image-31850 mb-0 size-chrono\" title=\"house comparison\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/03\/1000-Project-Graph-6-3-723x390.jpg\" alt=\"buying a house\" width=\"723\" height=\"390\" data-overlay-text=\"\" data-overlay-color=\"\" \/><\/a><\/p>\n<p><strong>WHAT CAN HAPPEN:<\/strong><\/p>\n<p><strong>Size matters<\/strong><\/p>\n<p style=\"text-align: justify;\">Big, Mediterranean-style homes with parlors and bedrooms galore can make apartment dwellers green with envy. But the bigger the house, the higher the energy and maintenance costs. Also, freestanding houses have more sides to maintain than townhouses and are more expensive to heat, cool, and keep up.<\/p>\n<p><strong>WHAT YOU CAN DO:<\/strong><\/p>\n<p><strong>Get data on energy costs and make a plan<\/strong><\/p>\n<p style=\"text-align: justify;\">What does it cost to heat and cool the home you are looking to buy? Energy costs are one of the major costs that homeowners have every month. For example, if the house you have is running a 40-year-old gas boiler with shoddy insulation and window-unit air conditioners, the energy costs will be very different from a well-insulated home with a new energy-efficient HVAC system. Energy costs will vary according to season and climate, of course.<\/p>\n<p>It’s a good idea to ask for ballpark energy costs from the current owners and also do your own research given the type of heating and cooling units and square footage.<\/p>\n<p style=\"text-align: justify;\">Learn the lifespan and replacement costs of your energy-related components, including the windows, skylights, heating and cooling systems, insulation, and type of energy used. What can you plan to upgrade that will pay for itself? Homeowners often have a lot of opportunities to make strategic energy upgrades because improving energy systems have a direct effect on lowering costs, making the return on investment higher.<\/p>\n<p>Energy efficiency upgrades have some of the highest returns on investment of any home improvement project.<\/p>\n<p><strong>WHAT CAN HAPPEN:<\/strong><\/p>\n<p><strong>Quality<\/strong> <strong>counts<\/strong><\/p>\n<p style=\"text-align: justify;\">Are you considering buying a brand new house? You may very well pay zero in home maintenance during your first year and get years and years of use out of your roof, HVAC system, water heater, and appliances. Compare that with a home that is 50 years old where the mechanicals haven’t been replaced recently and you’ll see a very different outlay of cash for maintenance in the early years.<\/p>\n<p style=\"text-align: justify;\">Be aware that over time, quality matters much more than age. A solidly built home will beat a shoddily built home any day of the week in terms of return. It’s best to take age into account when figuring out your costs but look at the overall quality of construction as well, especially if you plan to remain in the home a while. A new home that is poorly made may be less expensive initially, but you could really pay down the road if there are structural issues due to poor construction or you have to replace a lot of the finishings and details because corners were cut on quality.<\/p>\n<p><strong>WHAT YOU CAN DO:<\/strong><\/p>\n<p><strong>Don’t skimp on home inspections<\/strong><\/p>\n<p style=\"text-align: justify;\">It’s standard practice to have an inspection of the home before you close on it. The timing for inspections and extra due diligence differs among states. In some states, due diligence is done after a contract is signed during an agreed upon time period, and in others, it occurs before a contract is signed. It&#8217;s best to consult a local real estate agent to get an overview and get advice from a real estate lawyer in your area.<\/p>\n<p style=\"text-align: justify;\">Be aware that some inspectors are more thorough than others and different types of homes have different kinds of potential issues. Each house will be viewed based on their own issues. You should always be at the inspection; don&#8217;t have your real estate agent go instead of you. A regular home inspection can take anywhere from 20 minutes for an apartment to an hour and a half for a large property and home.<\/p>\n<p style=\"text-align: justify;\">It&#8217;s best to ask around for an inspector who is known to be notoriously tough and thorough. Usually, your real estate agent can recommend one. And always rely on the buyer&#8217;s agent (your own) for the recommendation, not the seller&#8217;s agent!<\/p>\n<p>Next, figure out what the major risks are for the particular type of home you are buying. A home inspection consultation will cost $300-$1,000+. This cost varies depending on your home type, the different inspections you&#8217;re looking for, and your location.<\/p>\n<p><a href=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/03\/1000-Project-Graph-6-1.jpg\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignnone wp-image-32333 mb-0 size-chrono\" title=\"home inspection costs\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Project-Graph-6-585x149.jpg\" alt=\"\" width=\"585\" height=\"149\" data-overlay-text=\"\" data-overlay-color=\"\" srcset=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Project-Graph-6.jpg 585w, https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Project-Graph-6-300x76.jpg 300w\" sizes=\"(max-width: 585px) 100vw, 585px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">For example, old brownstones often have issues with cast iron sewer pipes running under the home and out to the city sewer line. Having the pipes thoroughly inspected could save you a $40,000 cost later on if the basement needs to be torn up and pipes replaced.<\/p>\n<p style=\"text-align: justify;\">In another example, a quick, visual inspection may not detect termite damage if there is no exposed wood to examine in a completely finished basement. A more thorough termite inspection could save you a huge repair cost that isn’t generally covered by homeowners insurance.<\/p>\n<p style=\"text-align: justify;\">A home inspector doesn&#8217;t do a full inspection on a chimney, and if having a fully functional chimney is important to you, it might pay to have it inspected, as it can often cost between $10,000-$15,000 if bricks have to be reworked and repaired. An inspection can make sure the brick inside the chimney isn&#8217;t crumbling and that smoke is being discharged properly for around $300.<\/p>\n<p style=\"text-align: justify;\">If you are looking at a property that has a well, consider getting it thoroughly inspected to determine the depth of the water table and the quality of the water. There can be contaminants in the groundwater that could affect your health as well as the resale value of your property in the future. This costs $325 on average, but you can also pair it with a septic inspection and get it all tested for around $500 on average.<\/p>\n<p><a href=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Project-Graph-9.jpg\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignnone wp-image-32017 mb-0 size-chrono\" title=\"inspection cost versus repair cost comparison\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/1000-Project-Graph-9-723x316.jpg\" alt=\"buying a house\" width=\"723\" height=\"316\" data-overlay-text=\"\" data-overlay-color=\"\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">Even if you don&#8217;t have a well, you might consider having the soil tested for contaminants if you have reason to be concerned about possible environmental hazards. Land that has had industrial uses in the past, fracking, and other situations, such as being located near the former site of a gas station, could pose a hazard to you and your family, affecting your health, causing expensive remediation, and affecting the resale value of your property. Testing costs $400 and up, depending on the complexity of the testing.<\/p>\n<p style=\"text-align: justify;\">While a home inspector will look at the foundation and note the type of construction, they won&#8217;t be able to tell if there&#8217;s a problem. A foundation engineer can tell if it is faulty or potentially unstable. Repair can run in the tens of thousands of dollars, so if you suspect foundation issues—compromised by flooding or possible unstable ground conditions—paying the relatively low fee for a foundation inspector, around $300-$400, can save you a lot of money and headaches.<\/p>\n<p>Seriously reconsider the purchase if any of the following turn up:<\/p>\n<ul>\n<li>Major roof issues<\/li>\n<li>Major construction quality issues<\/li>\n<li>Termite damage<\/li>\n<li>Soil contaminants<\/li>\n<li>Other environmental issues such as water quality<\/li>\n<li>Foundation issues<\/li>\n<li>Previous property flooding<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The point is, don’t be shy to ask for additional inspections! In extremely competitive markets, it can be tricky as bidding wars and cash-only offers with no inspection contingencies can be de rigueur. Even so, try to protect yourself as much as possible by looking for and identifying potential issues as best you can. You are not being unreasonable; you are protecting your investment.<\/p>\n<p><strong>OTHER CONSIDERATIONS<\/strong><\/p>\n<p><strong>Nice yards need work<\/strong><\/p>\n<p style=\"text-align: justify;\">You may have big dreams of rolling around on your expansive lawn, but it’s good to be realistic about the amount of time, effort, and money it takes to landscape (hint: a lot). Those Japanese Feather Oaks and mulched flower beds do need regular tending and new homeowners often underestimate the maintenance involved to keep even a small yard weed-free and looking lush.<\/p>\n<p><strong>Insurance that fits your needs<\/strong><\/p>\n<p style=\"text-align: justify;\">Homeowners insurance isn’t a one-size-fits-all situation. Because you are responsible for a whole building as a homeowner, read through your declaration page carefully and ask a lot of “what happens if” questions. Look for insurance that covers the full replacement cost of the home, since mortgage companies sometimes require you only cover the loan amount. Be sure to cover the full 100% of the replacement value of the building to protect your share.<\/p>\n<p style=\"text-align: justify;\">Also consider how much liability insurance you feel comfortable having if someone were to slip and fall on your walkway or get bit by your giant, yard-guarding Rottweiler, for example.<\/p>\n<p style=\"text-align: justify;\">Once you have the skinny on the expected costs, you can do a more accurate comparison when deciding between two properties. Home buying is an emotional decision, but that doesn’t mean you can’t also have a great financial result for your next chapter!<\/p>\n<p><em>Nicole Hamilton is the author of <a href=\"https:\/\/www.homeownering.com\/the-book\/\" target=\"_blank\" rel=\"noopener\">Avoid the Money Pit, Turn Your Home into a Financial Powerhouse<\/a>, and the founder of <a href=\"https:\/\/www.homeownering.com\/\" target=\"_blank\" rel=\"noopener\">Homeownering<\/a>, an independent and unbiased resource for homeowners to get great financial outcomes.<\/em><\/p>\n<p>—<\/p>\n<p>If you&#8217;re in the market for a townhouse, take a look at our <a href=\"https:\/\/sweeten.com\/renovation-101\/reno-101\/townhouse-renovation-guide-purchasing\/\" target=\"_blank\" rel=\"noopener\">guide on purchasing and renovating one<\/a>.<\/p>\n<p><a href=\"https:\/\/app.sweeten.com\/referral\/friends\" target=\"_blank\" rel=\"noopener\">Refer your renovating friends to Sweeten<\/a> and you’ll both receive a $250 Visa gift card when they sign a contract with a Sweeten general contractor.<\/p>\n<p><em>Sweeten handpicks the best general contractors to match each project’s location, budget, and scope, helping until project completion. Follow<a href=\"https:\/\/sweeten.com\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?hl=en&amp;q=https:\/\/sweeten.com\/&amp;source=gmail&amp;ust=1487123334350000&amp;usg=AFQjCNF-s1nTGSY1bZBvhvepV4__NXLnbQ\"> the blog <\/a>for renovation ideas and inspiration and when you’re ready to renovate, <a href=\"https:\/\/app.sweeten.com\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?hl=en&amp;q=https:\/\/app.sweeten.com\/&amp;source=gmail&amp;ust=1487123334350000&amp;usg=AFQjCNH5jftZWZCQjwNC73rbmrQee07Zhw\">start your renovation on Sweeten<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The expert guide for city dwellers who are seriously on the house hunt You’ve been eyeing the possibilities of having a lawn, an extra bedroom, and maybe even a man or woman cave. When you go to look at houses, you come back to your apartment feeling just a little bit more cramped. It’s exciting to [&hellip;]<\/p>\n","protected":false},"author":88923,"featured_media":32951,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":"","footnotes":""},"categories":[4356],"tags":[3845,3843,3846,3847,3848,3826],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.8 (Yoast SEO v20.8) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Moving from an apartment to a house? What you need to know...<\/title>\n<meta name=\"description\" content=\"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"So You Want to Own a House?\" \/>\n<meta property=\"og:description\" content=\"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\" \/>\n<meta property=\"og:site_name\" content=\"Sweeten\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theSweeten\" \/>\n<meta property=\"article:published_time\" content=\"2018-04-17T16:03:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-05-17T18:18:26+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"667\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Nicole Hamilton\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@sweeten_home\" \/>\n<meta name=\"twitter:site\" content=\"@sweeten_home\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nicole Hamilton\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\"},\"author\":{\"name\":\"Nicole Hamilton\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/person\/f865923de873dcb2b9abdacbc79c54d3\"},\"headline\":\"So You Want to Own a House?\",\"datePublished\":\"2018-04-17T16:03:59+00:00\",\"dateModified\":\"2023-05-17T18:18:26+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\"},\"wordCount\":1934,\"commentCount\":4,\"publisher\":{\"@id\":\"https:\/\/sweeten.com\/#organization\"},\"keywords\":[\"buying a house\",\"first-time homeowner\",\"home buying costs\",\"home inspection costs\",\"home maintenance costs\",\"homeowner advice\"],\"articleSection\":[\"Process &amp; Planning\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\",\"url\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\",\"name\":\"Moving from an apartment to a house? What you need to know...\",\"isPartOf\":{\"@id\":\"https:\/\/sweeten.com\/#website\"},\"datePublished\":\"2018-04-17T16:03:59+00:00\",\"dateModified\":\"2023-05-17T18:18:26+00:00\",\"description\":\"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.\",\"breadcrumb\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sweeten.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Process &amp; Planning\",\"item\":\"https:\/\/sweeten.com\/category\/process-and-planning\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"So You Want to Own a House?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sweeten.com\/#website\",\"url\":\"https:\/\/sweeten.com\/\",\"name\":\"Sweeten\",\"description\":\"Renovate to live, Sweeten to thrive\",\"publisher\":{\"@id\":\"https:\/\/sweeten.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sweeten.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/sweeten.com\/#organization\",\"name\":\"Sweeten\",\"url\":\"https:\/\/sweeten.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png\",\"contentUrl\":\"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png\",\"width\":1000,\"height\":254,\"caption\":\"Sweeten\"},\"image\":{\"@id\":\"https:\/\/sweeten.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theSweeten\",\"https:\/\/twitter.com\/sweeten_home\",\"https:\/\/instagram.com\/sweeten_home\/\",\"https:\/\/www.linkedin.com\/company\/the-sweeten\",\"https:\/\/www.pinterest.com\/sweetenhome\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/person\/f865923de873dcb2b9abdacbc79c54d3\",\"name\":\"Nicole Hamilton\",\"url\":\"https:\/\/sweeten.com\/author\/nicole-hamilton\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Moving from an apartment to a house? What you need to know...","description":"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/","og_locale":"en_US","og_type":"article","og_title":"So You Want to Own a House?","og_description":"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.","og_url":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/","og_site_name":"Sweeten","article_publisher":"https:\/\/www.facebook.com\/theSweeten","article_published_time":"2018-04-17T16:03:59+00:00","article_modified_time":"2023-05-17T18:18:26+00:00","og_image":[{"width":1000,"height":667,"url":"https:\/\/sweeten.com\/wp-content\/uploads\/2018\/04\/SWEETEN-Tracey-McFarland-Kitchen12-1.jpg","type":"image\/jpeg"}],"author":"Nicole Hamilton","twitter_card":"summary_large_image","twitter_creator":"@sweeten_home","twitter_site":"@sweeten_home","twitter_misc":{"Written by":"Nicole Hamilton","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#article","isPartOf":{"@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/"},"author":{"name":"Nicole Hamilton","@id":"https:\/\/sweeten.com\/#\/schema\/person\/f865923de873dcb2b9abdacbc79c54d3"},"headline":"So You Want to Own a House?","datePublished":"2018-04-17T16:03:59+00:00","dateModified":"2023-05-17T18:18:26+00:00","mainEntityOfPage":{"@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/"},"wordCount":1934,"commentCount":4,"publisher":{"@id":"https:\/\/sweeten.com\/#organization"},"keywords":["buying a house","first-time homeowner","home buying costs","home inspection costs","home maintenance costs","homeowner advice"],"articleSection":["Process &amp; Planning"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/","url":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/","name":"Moving from an apartment to a house? What you need to know...","isPartOf":{"@id":"https:\/\/sweeten.com\/#website"},"datePublished":"2018-04-17T16:03:59+00:00","dateModified":"2023-05-17T18:18:26+00:00","description":"Thinking of upgrading from a studio to a brownstone? Find out what it costs and what to consider during the buying process.","breadcrumb":{"@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sweeten.com\/process-and-planning\/so-you-want-to-own-a-house\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sweeten.com\/"},{"@type":"ListItem","position":2,"name":"Process &amp; Planning","item":"https:\/\/sweeten.com\/category\/process-and-planning\/"},{"@type":"ListItem","position":3,"name":"So You Want to Own a House?"}]},{"@type":"WebSite","@id":"https:\/\/sweeten.com\/#website","url":"https:\/\/sweeten.com\/","name":"Sweeten","description":"Renovate to live, Sweeten to thrive","publisher":{"@id":"https:\/\/sweeten.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sweeten.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/sweeten.com\/#organization","name":"Sweeten","url":"https:\/\/sweeten.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sweeten.com\/#\/schema\/logo\/image\/","url":"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png","contentUrl":"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png","width":1000,"height":254,"caption":"Sweeten"},"image":{"@id":"https:\/\/sweeten.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theSweeten","https:\/\/twitter.com\/sweeten_home","https:\/\/instagram.com\/sweeten_home\/","https:\/\/www.linkedin.com\/company\/the-sweeten","https:\/\/www.pinterest.com\/sweetenhome\/"]},{"@type":"Person","@id":"https:\/\/sweeten.com\/#\/schema\/person\/f865923de873dcb2b9abdacbc79c54d3","name":"Nicole Hamilton","url":"https:\/\/sweeten.com\/author\/nicole-hamilton\/"}]}},"_links":{"self":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts\/31676"}],"collection":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/users\/88923"}],"replies":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/comments?post=31676"}],"version-history":[{"count":0,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts\/31676\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/media\/32951"}],"wp:attachment":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/media?parent=31676"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/categories?post=31676"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/tags?post=31676"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}