{"id":41534,"date":"2023-04-19T10:22:15","date_gmt":"2023-04-19T14:22:15","guid":{"rendered":"https:\/\/sweeten.com\/?p=41534"},"modified":"2023-09-20T03:00:49","modified_gmt":"2023-09-20T07:00:49","slug":"remodeling-guide-los-angeles","status":"publish","type":"post","link":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/","title":{"rendered":"A Guide to Home Remodeling in Los Angeles"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text]<\/p>\n<h2>What you need to know, from hillsides and permits to seismic retrofitting<\/h2>\n<p><img decoding=\"async\" class=\"mb-10 alignnone wp-image-46472 size-full\" title=\"kitchen island\" src=\"https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15.jpg\" alt=\"Neutral living room with fireplace\" width=\"1000\" height=\"667\" data-overlay-text=\"\" data-overlay-color=\"\" srcset=\"https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15.jpg 1000w, https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15-300x200.jpg 300w, https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15-600x400.jpg 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><span class=\"img-label\"> (<em>Above<\/em>) <a href=\"https:\/\/sweeten.com\/sweeten-renovations\/a-ranch-style-home-and-garage-renovation-for-actress-producer-jaime-ray-newman\/\" target=\"_blank\" rel=\"noopener\">Home remodel in Los Angeles<\/a> by Sweeten homeowner and actress Jaime Ray Newman<\/span><\/p>\n<p>Renovating in L.A. has a few unique twists—how do you remodel on a hillside lot while making your home earthquake-proof? What about embracing the city’s green ethos that could help the planet while shrinking your monthly electric and water budget? And how does all this play into the cost of your project?<\/p>\n<p>With a little bit of research, preparation, and the right team around you, an L.A. renovation can be a satisfying, creative endeavor that yields sizable dividends on your investment. We asked a couple of <a href=\"https:\/\/sweeten.com\/\" target=\"_blank\" rel=\"noopener\">Sweeten<\/a> remodeling professionals what specific issues homeowners in Los Angeles should know.<\/p>\n<h3>What to know about renovating on a hillside<\/h3>\n<p>With the more-leveled lots having been snapped up long ago, the majority of new homes being built in L.A. are going up on sloped lots and hillsides, according to <em><a href=\"https:\/\/la.curbed.com\/2017\/5\/16\/15625852\/vacant-lot-hillside-los-angeles-for-sale\" target=\"_blank\" rel=\"noopener noreferrer\">Curbed L.A.<\/a><\/em>. Some of the most desirable neighborhoods—who doesn’t want a view?— can be found on hillsides.<\/p>\n<ul>\n<li>Call in a structural engineer: Your first step with a hillside renovation is to call in a structural engineer to assess the condition of your lot, according to Sweeten<a href=\"https:\/\/app.sweeten.com\/members\/5767#overview\" target=\"_blank\" rel=\"noopener noreferrer\"> architect Jordan<\/a>. “A good structural engineer will do a site visit and let you know how complex it will be so you can decide whether to kill the project or continue,” he said. A Sweeten contractor working on your project can recommend an engineer.<\/li>\n<li>Consider your timeline: It will take a bit of extra care, preparation and time if you’re planning new construction or a significant renovation on a hillside. “Building on a hillside is in a way different ballpark,” said Sweeten <a href=\"https:\/\/app.sweeten.com\/members\/5716#overview\" target=\"_blank\" rel=\"noopener noreferrer\">contractor  Netanel<\/a>, adding that access to the site for construction crews can add up.<\/li>\n<li>Special requirements: Hillside projects require a structurally engineered retaining wall that is made from concrete, said Sweeten <a href=\"https:\/\/app.sweeten.com\/members\/5589#overview\" target=\"_blank\" rel=\"noopener noreferrer\">contractors Anna and Vahik<\/a>. These types of projects can also need stormwater drainage plans, sewage disposal, water supply as well as access for fire safety elements, which all increase the budget.\n<ul>\n<li>Fire safety: One project—a 6,000-square-foot hillside property—that Anna is working on was 300 feet from the nearest fire hydrant. The estimate to install a public fire hydrant near their driveway came to $30,000. The homeowners opted for a commercial sprinkler system throughout the home instead.<\/li>\n<li>Since it is becoming a common requirement to keep water on your own property, drainage is another important issue. Water, such as rainwater, running down a hill from property to property can destabilize the ground, potentially causing a landslide. This can sometimes be solved by burying rocks and gravel underneath a lawn or garden, allowing excess water to funnel through the ground rather than run off the property.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3>When do you need soil testing for your remodel?<\/h3>\n<p>One of the first items many renovation projects in L.A. require is a soil report. If you’re adding a new room, a second story, or a retaining wall or if you are on a hillside, you will most certainly need this. “The soil or geotechnical report gives an understanding of earth conditions affecting a building,” explained Sweeten contractors Anna and Vahik.<\/p>\n<p>Those performing the soil report are looking for how firm the soil is or if there is bedrock, especially when building on a hillside. “Sometimes you have to go down five feet to get down to bedrock. Sometimes it is 50 feet,” said Sweeten architect Jordan. The results will determine how much work is needed to “get out of the ground,” meaning what is needed to support a secure foundation, he said.<\/p>\n<p>Getting the report results can take a month or two. The good news? Our L.A. contractors have never been prevented from moving forward with a project because of a soil report.<\/p>\n<h3>What’s involved in a seismic retrofit?<\/h3>\n<p>There’s a reason why L.A. requires due diligence when it comes to hillside renovations and soil reports: earthquakes. It’s also why a seismic retrofit is a good idea for older apartment buildings. Seismic retrofits are mandated for apartment buildings built before 1978 with wood frames that have parking or a similar open space as a ground floor.<\/p>\n<p>This is not the case for single-family homes. Taking the initiative to do a seismic retrofit is highly recommended because it can add value to your home, but it is not mandatory. A seismic retrofit of a single-family home essentially adds extra bracing around the crawl space, which is the shallow area under the ground floor that provides room for pipes and electrical wiring. “This ensures you have a strong mechanical connection between the framing of the house and the foundation” in an earthquake, said Jordan.<\/p>\n<p>Sweeten has found that the cost of a retrofit for a 2,000-square-foot house will likely come in between $10,000 and $15,000. Whether there is any damage or rot to the existing framing as well as the cost of materials and labor will impact that figure, according to Sweeten.<\/p>\n<h3>Average renovation costs in LA<\/h3>\n<ul>\n<li aria-level=\"1\">On average, many of our <a href=\"https:\/\/sweeten.com\/lp\/entire-home\/renovations\/\" target=\"_blank\" rel=\"noopener\">whole home remodeling<\/a> costs in Los Angeles range from <a href=\"https:\/\/sweeten.com\/renovation-cost-guides\/home-renovation-costs-per-square-foot-in-los-angeles\/\" target=\"_blank\" rel=\"noopener\">$100 to $400+ psf<\/a>. Renovating dry rooms, such as living rooms and bedrooms, is generally less expensive compared to wet rooms like kitchens and bathrooms. The estimated starting cost for dry rooms is on the lower end of the spectrum, while wet rooms can be as high as $400 per square foot.<\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/sweeten.com\/lp\/kitchen\/renovations\/\" target=\"_blank\" rel=\"noopener\">Sweeten kitchen remodeling<\/a> costs start at $24,500 for 200 square feet, with budget-friendly finishes from retailers like Lowe&#8217;s. For mid-grade kitchen remodeling, Sweeten project <a href=\"https:\/\/sweeten.com\/renovation-cost-guides\/kitchen-remodeling-costs-in-los-angeles\/\" target=\"_blank\" rel=\"noopener\">costs can average<\/a> at $37,500, covering new stock or semi-custom cabinets, appliances, and manufactured or quartz countertops. High-end kitchen projects can begin at $76,000, with a significant portion of the cost going towards custom cabinetry.<\/li>\n<li>A budget <a href=\"https:\/\/sweeten.com\/lp\/bathroom\/renovations\/\" target=\"_blank\" rel=\"noopener\">bathroom renovation<\/a> of 35 square feet, including demo, plumbing work, and new finishes, starts at $18,000, often utilizing big-box stores for materials, according to Sweeten contractors. A mid-grade bathroom in <a href=\"https:\/\/sweeten.com\/renovation-cost-guides\/bathroom-remodeling-costs-in-los-angeles\/\" target=\"_blank\" rel=\"noopener\">Los Angeles will cost on average<\/a> between $28,500. Sweeten contractors report that the average cost for an upscale bathroom project, which includes expanding the space from 35 to 100 square feet, starts at around $40,500.<\/li>\n<\/ul>\n<h3>Title 24 requirements when renovating<\/h3>\n<p>The building code Title 24 is the result of California’s leadership in sustainability. It is a set of standards some projects must meet for “energy conservation, green design, construction and maintenance, fire and life safety, and accessibility.”<\/p>\n<p>Title 24 requirements are triggered when your remodel meets a certain scope, such as the building envelope changes like replacing windows, adding a door, or a new room. Renovations that alter the heating, cooling, and water systems can also prompt Title 24 requirements. An internal project, such as a minimal bathroom or <a href=\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-a-kitchen-in-los-angeles\/\" target=\"_blank\" rel=\"noopener\">kitchen renovation<\/a>, might avoid those requirements, but “Title 24 is going to pop up on a lot of projects,” said Jordan.<\/p>\n<p>There are two different methods for meeting Title 24 requirements:<\/p>\n<ul>\n<li>The prescriptive method involves criteria such as insulation in the home, efficient heating and air conditioning, and limiting the number of windowed areas in the home compared to floor area.<\/li>\n<li>The performance method involves trade-offs. For example, the windowed area in the home can increase as long as insulation or efficient heating and cooling mechanisms do, too.<\/li>\n<\/ul>\n<p>It’s no secret that California’s Title 24 is complicated and ever-changing, but an experienced building professional will help guide you through the requirements. For more details about Title 24 and renovating. At the end of the day, it is both good for the environment and your wallet when it comes to your electrical bill.<\/p>\n<h3>Renovations in condos<\/h3>\n<p>Not only must you deal with red tape from the city, but your condo’s homeowner’s association (HOA) will also want to have its say. While every building is different, typically condo HOAs will restrict what you can do to the outside appearance of your condo and be less interested in what you do to the interior.<\/p>\n<p>Condo renovations can cost slightly more and take a little longer. That’s because construction work is usually restricted to an eight-hour window on weekdays. (That includes the time needed to clean up any common areas each day. ) There are also the HOA rules, from where your building team will park their vehicles to how and when the construction crews might access the condo, and how they can lug away trash.<\/p>\n<p>Condos will likely call for higher levels of insurance. For some Sweeten contractors, one million is considered low for condo work, and the HOA sometimes asks to be additionally insured.<\/p>\n<p>While it is likely the condo manager will act as a bridge between your project and your condo’s HOA, it’s always good to give your neighbors a heads-up that you will be doing some work.<\/p>\n<h3>Remodeling permits in Los Angeles<\/h3>\n<p>Permits and local red tape can be a major hold-up for people looking to renovate, which is especially the case in Los Angeles. In a Renovation Stress Survey we conducted, Angelenos outranked all other U.S. markets as the most worried about getting local permits for their remodeling project. Though permits will ultimately be handled by your architect or general contractor, it’s helpful to know how long it will take and what the cost could be.<\/p>\n<p>Because of reporting requirements for Title 24, changing even a faucet or a light fixture might mean the need for a permit. Thankfully, the City of Los Angeles has made a big effort to speed up this process in recent years, especially when it comes to those smaller projects.<\/p>\n<p>There are 88 different cities that make up L.A. County and each has its own permitting process and fee structure.<\/p>\n<h4>When you need a permit<\/h4>\n<ul>\n<li>For example, in the City of Pasadena, only new structures, room additions, and larger remodeling jobs require plans to be submitted for a permit. Projects, like upgrading electrical or replacing a water heater, do not necessitate a plan, but they will require a permit.<\/li>\n<li>Like other L.A. cities, the cost for permits is linked to the cost of the project. In Pasadena, a permit for a $25,000 job without the need for plumbing or electrical or mechanical work will <a href=\"https:\/\/www.cityofpasadena.net\/finance\/wp-content\/uploads\/sites\/27\/FY-2022-Adopted-General-Fee-Schedule.pdf?v=1663609496459\" target=\"_blank\" rel=\"noopener noreferrer\">cost<\/a> at least $496. A $100,000 project will cost $2,108.<\/li>\n<li>Permits for larger projects—structural or mechanical changes or hillside renovations—could take up to a month, said Sweeten contractor Netanel. These larger renovations typically require architectural plans as well as a soil report.<\/li>\n<\/ul>\n<h4><a href=\"https:\/\/app.sweeten.com\/journey\/\" class=\"elementor-button-link\" target=\"_blank\" rel=\"noopener\"><span>Find a general contractor<\/span><\/a><br \/>\nWhen permits can be quick<\/h4>\n<ul>\n<li>For the City of Los Angeles, if your renovation project avoids structural changes such as a bathroom that <a href=\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/how-to-remodel-a-bathroom-in-los-angeles\/\" target=\"_blank\" rel=\"noopener\">retains the plumbing location<\/a> or a kitchen remodel that keeps the original layout, then you can obtain an express permit.<\/li>\n<li>Approval can be as quick as one day, according to contractors Anna and Vahik, or even instantly, if your project enables you to apply online.<\/li>\n<\/ul>\n<p>Cost of permits are calculated by the value of the project and to take the guesswork out of it, L.A.’s Department of Building and Safety has <a href=\"https:\/\/www.ladbs.org\/services\/pay-fees\/permit-fee-calculator\">a fee calculator<\/a>. For a $20,000 renovation that doesn’t require plumbing or electrical or mechanical work, for instance, the permitting fee estimate is just under $700.<\/p>\n<h3>Finding your renovation team<\/h3>\n<p><span style=\"font-weight: 400;\">While general contractors are readily available, finding one with experience in your specific project scope, budget, building type, and location in Los Angeles can be a challenge. It&#8217;s also important to consider their communication style and level of professionalism to <a href=\"https:\/\/sweeten.com\/process-and-planning\/the-ultimate-guide-to-hiring-a-general-contractor-for-your-remodel\/\" target=\"_blank\" rel=\"noopener\">ensure a good match<\/a>.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are multiple choices available for the design, demolition, and construction of your project. In Los Angeles, the options for remodeling services include hiring an architect\/interior designer along with a general contractor, solely a general contractor or builder, or a design-build firm.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Collaborate with an Architect\/Interior Designer and Contractor for Your Project<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">An <a href=\"https:\/\/sweeten.com\/sweeten-renovations\/entire-home-renovations\/a-los-angeles-full-home-renovation-gets-an-ubermodern-look-inside-and-out\/\" target=\"_blank\" rel=\"noopener\">architect\/interior designer and contractor<\/a> to bring your vision to life. They can identify potential issues and help distribute the budget. Options include a creative design or detailed working drawings with MEP information. Expect to allocate 10-20% of your project budget for this service<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Complete your project with a general contractor<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Sweeten general contractors are highly experienced to complete a rip-and-replace project or a full gut remodel in Los Angeles, provided that there is clear communication. While some contractors require a finished plan and offer no design work, others can assist with limited design experience. It&#8217;s recommended to meet with multiple contractors on-site to discuss the project and ensure a good rapport.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Collaborate with a design-build firm<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">By working with a Sweeten design-build firm, you can benefit from having both the designer and contractor under one roof, improving the continuity and efficiency of the entire project.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To hire a general contractor in Los Angeles, start by arranging site visits and obtaining estimates from <a href=\"https:\/\/sweeten.com\/ca\/los-angeles-general-contractors\/\" target=\"_blank\" rel=\"noopener\">several local contractors<\/a>. You can easily <a href=\"https:\/\/app.sweeten.com\/journey\/\" target=\"_blank\" rel=\"noopener\">connect with top general contractors<\/a> in LA for your remodeling project by posting it on Sweeten.<\/span><\/p>\n<p><em>Updated on April 19, 2023<\/em><\/p>\n<p>—<\/p>\n<p><em>Sweeten handpicks the best general contractors to match each project’s location, budget, and scope, helping until project completion. Follow the blog, <a href=\"https:\/\/sweeten.com\/\" target=\"_self\" rel=\"noopener noreferrer\">Sweeten Stories<\/a>, for renovation ideas and inspiration and when you’re ready to renovate, <a href=\"https:\/\/app.sweeten.com\/\" target=\"_self\" rel=\"noopener noreferrer\">start your renovation on Sweeten<\/a>.<\/em>[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text] What you need to know, from hillsides and permits to seismic retrofitting (Above) Home remodel in Los Angeles by Sweeten homeowner and actress Jaime Ray Newman Renovating in L.A. has a few unique twists—how do you remodel on a hillside lot while making your home earthquake-proof? What about embracing the city’s green ethos that [&hellip;]<\/p>\n","protected":false},"author":88909,"featured_media":46472,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":"","footnotes":""},"categories":[4361],"tags":[226],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.8 (Yoast SEO v20.8) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A Guide to Renovating Homes in Los Angeles, California<\/title>\n<meta name=\"description\" content=\"Here&#039;s a guide to renovating a home in Los Angeles, from the permits you&#039;ll need to requirements for renovating on a hillside.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Guide to Home Remodeling in Los Angeles\" \/>\n<meta property=\"og:description\" content=\"Here&#039;s a guide to renovating a home in Los Angeles, from the permits you&#039;ll need to requirements for renovating on a hillside.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\" \/>\n<meta property=\"og:site_name\" content=\"Sweeten\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theSweeten\" \/>\n<meta property=\"article:published_time\" content=\"2023-04-19T14:22:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-20T07:00:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"667\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Serena Solomon\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@sweeten_home\" \/>\n<meta name=\"twitter:site\" content=\"@sweeten_home\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Serena Solomon\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\"},\"author\":{\"name\":\"Serena Solomon\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/person\/ab9902cd651bdd7713a0d92feffdb454\"},\"headline\":\"A Guide to Home Remodeling in Los Angeles\",\"datePublished\":\"2023-04-19T14:22:15+00:00\",\"dateModified\":\"2023-09-20T07:00:49+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\"},\"wordCount\":2214,\"commentCount\":18,\"publisher\":{\"@id\":\"https:\/\/sweeten.com\/#organization\"},\"keywords\":[\"Los Angeles\"],\"articleSection\":[\"Renovating in the West\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\",\"url\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\",\"name\":\"A Guide to Renovating Homes in Los Angeles, California\",\"isPartOf\":{\"@id\":\"https:\/\/sweeten.com\/#website\"},\"datePublished\":\"2023-04-19T14:22:15+00:00\",\"dateModified\":\"2023-09-20T07:00:49+00:00\",\"description\":\"Here's a guide to renovating a home in Los Angeles, from the permits you'll need to requirements for renovating on a hillside.\",\"breadcrumb\":{\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sweeten.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Process &amp; Planning\",\"item\":\"https:\/\/sweeten.com\/category\/process-and-planning\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Renovating in the West\",\"item\":\"https:\/\/sweeten.com\/category\/process-and-planning\/renovating-in-the-west\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"A Guide to Home Remodeling in Los Angeles\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sweeten.com\/#website\",\"url\":\"https:\/\/sweeten.com\/\",\"name\":\"Sweeten\",\"description\":\"Renovate to live, Sweeten to thrive\",\"publisher\":{\"@id\":\"https:\/\/sweeten.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sweeten.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/sweeten.com\/#organization\",\"name\":\"Sweeten\",\"url\":\"https:\/\/sweeten.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png\",\"contentUrl\":\"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png\",\"width\":1000,\"height\":254,\"caption\":\"Sweeten\"},\"image\":{\"@id\":\"https:\/\/sweeten.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theSweeten\",\"https:\/\/twitter.com\/sweeten_home\",\"https:\/\/instagram.com\/sweeten_home\/\",\"https:\/\/www.linkedin.com\/company\/the-sweeten\",\"https:\/\/www.pinterest.com\/sweetenhome\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/sweeten.com\/#\/schema\/person\/ab9902cd651bdd7713a0d92feffdb454\",\"name\":\"Serena Solomon\",\"url\":\"https:\/\/sweeten.com\/author\/serena\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"A Guide to Renovating Homes in Los Angeles, California","description":"Here's a guide to renovating a home in Los Angeles, from the permits you'll need to requirements for renovating on a hillside.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/","og_locale":"en_US","og_type":"article","og_title":"A Guide to Home Remodeling in Los Angeles","og_description":"Here's a guide to renovating a home in Los Angeles, from the permits you'll need to requirements for renovating on a hillside.","og_url":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/","og_site_name":"Sweeten","article_publisher":"https:\/\/www.facebook.com\/theSweeten","article_published_time":"2023-04-19T14:22:15+00:00","article_modified_time":"2023-09-20T07:00:49+00:00","og_image":[{"width":1000,"height":667,"url":"https:\/\/sweeten.com\/wp-content\/uploads\/2020\/09\/Sweeten-Jaime-LA_ADU-15.jpg","type":"image\/jpeg"}],"author":"Serena Solomon","twitter_card":"summary_large_image","twitter_creator":"@sweeten_home","twitter_site":"@sweeten_home","twitter_misc":{"Written by":"Serena Solomon","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#article","isPartOf":{"@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/"},"author":{"name":"Serena Solomon","@id":"https:\/\/sweeten.com\/#\/schema\/person\/ab9902cd651bdd7713a0d92feffdb454"},"headline":"A Guide to Home Remodeling in Los Angeles","datePublished":"2023-04-19T14:22:15+00:00","dateModified":"2023-09-20T07:00:49+00:00","mainEntityOfPage":{"@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/"},"wordCount":2214,"commentCount":18,"publisher":{"@id":"https:\/\/sweeten.com\/#organization"},"keywords":["Los Angeles"],"articleSection":["Renovating in the West"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/","url":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/","name":"A Guide to Renovating Homes in Los Angeles, California","isPartOf":{"@id":"https:\/\/sweeten.com\/#website"},"datePublished":"2023-04-19T14:22:15+00:00","dateModified":"2023-09-20T07:00:49+00:00","description":"Here's a guide to renovating a home in Los Angeles, from the permits you'll need to requirements for renovating on a hillside.","breadcrumb":{"@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sweeten.com\/process-and-planning\/renovating-in-the-west\/remodeling-guide-los-angeles\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sweeten.com\/"},{"@type":"ListItem","position":2,"name":"Process &amp; Planning","item":"https:\/\/sweeten.com\/category\/process-and-planning\/"},{"@type":"ListItem","position":3,"name":"Renovating in the West","item":"https:\/\/sweeten.com\/category\/process-and-planning\/renovating-in-the-west\/"},{"@type":"ListItem","position":4,"name":"A Guide to Home Remodeling in Los Angeles"}]},{"@type":"WebSite","@id":"https:\/\/sweeten.com\/#website","url":"https:\/\/sweeten.com\/","name":"Sweeten","description":"Renovate to live, Sweeten to thrive","publisher":{"@id":"https:\/\/sweeten.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sweeten.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/sweeten.com\/#organization","name":"Sweeten","url":"https:\/\/sweeten.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sweeten.com\/#\/schema\/logo\/image\/","url":"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png","contentUrl":"https:\/\/sweeten.com\/wp-content\/uploads\/2023\/03\/Medium-Blue-Horizontal-White-background.png","width":1000,"height":254,"caption":"Sweeten"},"image":{"@id":"https:\/\/sweeten.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theSweeten","https:\/\/twitter.com\/sweeten_home","https:\/\/instagram.com\/sweeten_home\/","https:\/\/www.linkedin.com\/company\/the-sweeten","https:\/\/www.pinterest.com\/sweetenhome\/"]},{"@type":"Person","@id":"https:\/\/sweeten.com\/#\/schema\/person\/ab9902cd651bdd7713a0d92feffdb454","name":"Serena Solomon","url":"https:\/\/sweeten.com\/author\/serena\/"}]}},"_links":{"self":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts\/41534"}],"collection":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/users\/88909"}],"replies":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/comments?post=41534"}],"version-history":[{"count":0,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/posts\/41534\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/media\/46472"}],"wp:attachment":[{"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/media?parent=41534"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/categories?post=41534"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sweeten.com\/wp-json\/wp\/v2\/tags?post=41534"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}